'''
Завдання 1. Оптимізація виробництва
Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". Для виробництва цих напоїв використовуються 
різні інгредієнти та обмежена кількість обладнання. Задача полягає у максимізації виробництва, враховуючи 
обмежені ресурси.

Умови завдання:
1. "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
2. "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".
3. Обмеження ресурсів: 100 од. "Води", 50 од. "Цукру", 30 од. "Лимонного соку" та 40 од. "Фруктового пюре".
4. Виробництво одиниці "Лимонаду" вимагає 2 од. "Води", 1 од. "Цукру" та 1 од. "Лимонного соку".
5. Виробництво одиниці "Фруктового соку" вимагає 2 од. "Фруктового пюре" та 1 од. "Води".

x та y відповідно до кількості одиниць "Лимонаду" та "Фруктового соку".
z= x+y -> max
2x+y<=100
x<=50
x<=30
2y<=40
x>=0
y>=0
'''

import pulp

def main():
    model = pulp.LpProblem("Максимізація виробництва", pulp.LpMaximize)  
    y = pulp.LpVariable('Фруктового соку', 0, cat='Integer')
    x = pulp.LpVariable('Лимонаду', 0, cat='Integer')
    model += x + y, "Problem"
    model += 2 * x + y <= 100, 'Води'
    model += x <= 50, 'Цукру'
    model += x <= 30, 'Лимоновий сок'
    model += 2 * y <= 40, 'Фруктовий пюре'

    if pulp.LpStatus[model.solve()] == 'Optimal':
        for var in model.variables():
            print(f"{var.name} {var.varValue} одиниць")

if __name__ == '__main__':
    main()